package model;

import java.util.Random;

public class RandomizationData {
    private static String[] surnameList = {
            "Бутрин", "Окабэ", "Василевский", "Поживилко", "Штрасс", "Козловский", "Распутин", "Жуков", "Козлов", "Лукашэнко", "Шункевич", "Голенков","Петров", "Садовский","Синельников", "Раманов", "Калиновский", "Зализняк", "Шагал", "Малевич", "Гандзи", "Ленин", "Гарбачев", "Гагарин", "Леонтьев", "Лавкрафт", "Манчан", "Колас", "Купала", "Лермантов", "Блок", "Ломаносов", "Летов", "Энштэйн", "Эйлер", "Бернули", "Буль", "Лем", "Цой", "Ким", "Маркс", "Дэн", "Мао", "Ван Бюрэн", "Махно", "Гаус",  "Рыбников", "Ямаока", "Кодзима", "Хэмил", "Форд", "Гётэ", "Станкевич", "Кутузов", "Камю", "Оруэл", "Макисе", "Чёрч", "Пит", "Граймс", "Анно", "Тьюринг", "Фримэн", "Калхун", "Вэнс", "Клаус", "Азимов", "Стругацкий", "Гонтарев", "Ли", "Кобэйн", "Кинг"
                    },
                            nameList = {
            "Станислав", "Линус", "Андрей", "Алексей", "Владимир", "Павел", "Джон",  "Александр", "Генадий", "Максим",  "Юрий", "Иван", "Марк", "Казимир", "Ульфрык", "Герберт", "Стэфан", "Якуб", "Янка", "Михаил", "Даниил", "Дмитрий", "Сергей", "Виктор", "Чен Ир", "Ир Сэн", "Чен Ин", "Нурсултан", "Мустафа", "Карл", "Цзэдун", "Отто", "Адольф", "Николай", "Армэн", "Ринтаро", "Ганс", "Нестер", "Стив", "Глеб",  "Акира", "Хидэо", "Сердж", "Томми", "Генрих", "Илья",  "Напалеон", "Герман",  "Сильвестер", "Жан-Жак",  "Алан", "Гордан", "Барни",  "Айзэк", "Куан Ю", "Макар", "Курт", "Мартин", "Лютэр","Камина","Симон"
                    },
                            patronymList = {
            "Адамович", "Платонович", "Семёнович", "Рыгоравич", "Иванович", "Александрович",  "Валентинович",  "Валерьянович", "Игаревич",  "Анатольевич", "Мустафавич", "Стэфанавич", "Юрьевич", "Армени", "Эстрыдсан", "Торстэнсан", "Антыпойка", "Васи", "Пека", "Салим-аглы",  "ибн Мухаммад", "бэн Давид", "бар Йохай", "фи дэ Геральд", "Карлавич", "Ильич", "Петрович",   "Гендасан",  "Герасимович", "Сидорович"
                    };
                    //        examNameList = {
            //"Беларуская мова", "Матэматычны аналіз", "Асновы акцэнталогіі", "Філасофія", "Фізічная культура і здароўе", "Тапалогія", "Тэорыя імавернасцей", "Гісторыя Ўсходняга Тымара", "ППуІС", "МАІС", "МРЗуІС", "ЫЫЫЫ", "Замежная літаратура", "Татарская мова", "Царкоўна-славянская мова", "Фарсі", "Хіндзі", "Кітайская мова", "ВОВСНВМВ", "Электронныя прылады", "Фізіка", "Сальфеджыа", "Сусветная гісторыя", "Грамадазнаўства", "Паліталогія", "Выешал", "Эсперанта", "Асновы канструявання моў", "Архітэктура", "Хімія", "Ангельская мова", "Венгерская мова", "Гішпанская мова", "Польская мова", "ТІІТ", "Тэалогія", "Асновы мовазнаўства", "Расейская мова", "Геаграфія", "Труд", "Алгебра", "Чарчэнне", "Літоўская мова", "Валапюк", "Інтэрлінгва", "Ідыш", "Іўрыт", "Гісторыя Кіпра", "Кяхцінская мова", "Русенорск", "Французская літаратура", "Літаратуразнаўства", "Біялогія", "Анатомія", "Заалогія", "Археалогія", "Лексікаграфія", "Фаналогія", "Краіназнаўства", "Гісторыя Лівана", "Арабская дыялекталогія", "Мова майя", "Старажытна-руская акцэнталогія", "Тыбецкая мова", "Праславянская мова", "Картаграфія", "Гісторыя архітэктуры", "Прамысловая інжэнерыя", "Оптыка", "Астраномія", "Батаніка", "Гісторыя мастацтваў", "Мастацтвазнаўства", "Гісторыя кіно", "Гісторыя музыкі", "Каліграфія", "Маркетынг", "Тувінская мова", "Гісторыя Тувы", "Гісторыя Мары Эм", "Ятвяжская мова", "Латынь", "Эканоміка", "Тэорыя марксізма", "Палітычная лінгвістыка", "Практыка перакладу", "Японская мова", "Кхоса", "Гісторыя антычнай Украіны", "Гісторыя Югаславіі", "Баснійская мова"
           //         };

    public static String reqSurname(){
        return surnameList[new Random().nextInt(surnameList.length)];
    }

    public static String reqName(){
        return nameList[new Random().nextInt(nameList.length)];
    }

    public static String reqPatronym(){
        return patronymList[new Random().nextInt(patronymList.length)];
    }

  //  public static String reqExamName(){
   //     return examNameList[new Random().nextInt(examNameList.length)];
   // }
}
